Autodesk.Revit.DB.ScheduleDefinition.IsSchedulableField(Autodesk.Revit.DB.SchedulableField)
Checks whether a non-calculated/non-combined field is eligible to be included in
this schedule.
schedulableField:
The field to check.
Returns:
True if the field may be included in the schedule, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanFilterByGlobalParameters(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used with a global parameter-based filter.
Remarks:
The global parameter-based filter types are IsAsociatedWith, IsNotAssociatedWith.
Only parameters which have a compatible type with at least one existing global parameter
can be filtered.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used with a global parameter-based filter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.ScheduleDefinition.CanFilterBySubstring(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used with a substring-based filter.
Remarks:
The substring-based filter types are Contains, NotContains,
BeginsWith, NonBeginsWith, EndsWith and NotEndsWith.
Only string parameters can be filtered by substring.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used with a substring-based filter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanFilterByValuePresence(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used with a value presence-based filter.
Remarks:
The value presence filter types are HasValue and HasNoValue.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used with a value presence filter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.ScheduleDefinition.CanFilterByValue(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used with a value-based filter.
Remarks:
The value-based filter types are Equal, NotEqual,
GreaterThan, GreaterThanOrEqual, LessThan and LessThanOrEqual.
Only certain types of parameters can be filtered by value.
Note that some fields (for example, Workset, Family, Type, Family and Type)
only support Equal, NotEqual, but not GreaterThan, GreaterThanOrEqual, LessThan and LessThanOrEqual.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used with a value based filter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanFilterByParameterExistence(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used with a HasParameter filter.
Remarks:
The HasParameter filter type only supports shared parameters,
and only with the Instance or ElementType field types.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used with a HasParameter filter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetFilters(System.Collections.Generic.IList{Autodesk.Revit.DB.ScheduleFilter})
Replaces all filters in this ScheduleDefinition.
filters:
The new list of filters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resulting filter count would be greater than 8.
-or-
A field ID is not the ID of a field in this ScheduleDefinition.
-or-
A field and filter type cannot be used to filter this ScheduleDefinition.
-or-
A filter value is not valid for the field and filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetFilter(System.Int32,Autodesk.Revit.DB.ScheduleFilter)
Replaces a filter.
index:
The index of the filter to replace.
filter:
The new filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field and filter type cannot be used to filter this ScheduleDefinition.
-or-
The filter value is not valid for the field and filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid filter index.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.InsertFilter(Autodesk.Revit.DB.ScheduleFilter,System.Int32)
Adds a new filter at the specified position in the list.
filter:
The filter to add.
index:
The index in the list of filters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field and filter type cannot be used to filter this ScheduleDefinition.
-or-
The filter value is not valid for the field and filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
-or-
The resulting filter count would be greater than 8.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddFilter(Autodesk.Revit.DB.ScheduleFilter)
Adds a new filter at the end of the list.
filter:
The filter to add.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field and filter type cannot be used to filter this ScheduleDefinition.
-or-
The filter value is not valid for the field and filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not support filters.
-or-
The resulting filter count would be greater than 8.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsValidCategoryForFilterBySheet
Checks whether a schedule can be filtered by sheet.
Returns:
True if the schedule can be filtered by sheet,
false otherwise.
Since:
2023

Autodesk.Revit.DB.ScheduleDefinition.CanSortByField(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field can be used for sorting/grouping.
Remarks:
Schedules cannot be sorted/grouped by the Count field, Percentage
fields, or Formula fields that depend on Percentage fields because
those types of fields don't have meaningful values until after
sorting and grouping takes place.
fieldId:
The ID of the field to check.
Returns:
True if the field can be used for sorting/grouping, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetSortGroupFields(System.Collections.Generic.IList{Autodesk.Revit.DB.ScheduleSortGroupField})
Replaces all sorting/grouping fields in this ScheduleDefinition.
sortGroupFields:
The new list of sorting/grouping fields.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resulting sorting/grouping field count would be greater than 4.
-or-
A field ID is not the ID of a field in this ScheduleDefinition.
-or-
A field cannot be used for sorting/grouping.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetSortGroupField(System.Int32,Autodesk.Revit.DB.ScheduleSortGroupField)
Replaces a sorting/grouping field.
index:
The index of the sorting/grouping field to replace.
sortGroupField:
The new sorting/grouping field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field cannot be used for sorting/grouping.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid sorting/grouping field index.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.InsertSortGroupField(Autodesk.Revit.DB.ScheduleSortGroupField,System.Int32)
Adds a new sorting/grouping field at the specified position in the list.
sortGroupField:
The sorting/grouping field to add.
index:
The index in the list of sorting/grouping fields.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field cannot be used for sorting/grouping.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The resulting sorting/grouping field count would be greater than 4.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddSortGroupField(Autodesk.Revit.DB.ScheduleSortGroupField)
Adds a new sorting/grouping field at the end of the list.
sortGroupField:
The sorting/grouping field to add.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field ID is not the ID of a field in this ScheduleDefinition.
-or-
The field cannot be used for sorting/grouping.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The resulting sorting/grouping field count would be greater than 4.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsValidFieldId(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a ScheduleFieldId is the ID of a field in this ScheduleDefinition.
fieldId:
The field ID to check.
Returns:
True if the field ID is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetFieldIndex(Autodesk.Revit.DB.ScheduleFieldId)
Converts a field ID to the corresponding field index.
fieldId:
The field ID.
Returns:
The field index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.SetFieldOrder(System.Collections.Generic.IList{Autodesk.Revit.DB.ScheduleFieldId})
Reorders the fields in the schedule.
fieldIds:
The field IDs in a new order.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldIds does not contain exactly the same field IDs as this ScheduleDefinition currently contains.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.GetField(Autodesk.Revit.DB.ScheduleFieldId)
Gets a field.
fieldId:
The ID of the field.
Returns:
The field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.RemoveField(Autodesk.Revit.DB.ScheduleFieldId)
Removes a field.
fieldId:
The ID of the field to remove.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not the ID of a field in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.InsertCombinedParameterField(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData},System.String,System.Int32)
Adds a combined parameter field at the specified position in the list.
data:
The combined parameters array.
fieldName:
The field name.
index:
The index in the list of fields.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
Since:
2017

Autodesk.Revit.DB.ScheduleDefinition.IsValidCombinedParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Checks if data is valid for combined parameters
data:
data is array of TableCellCombinedParameterData to be set as combined parameters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.ScheduleDefinition.InsertField(Autodesk.Revit.DB.ScheduleFieldType,Autodesk.Revit.DB.ElementId,System.Int32)
Adds a regular field at the specified position in the list.
fieldType:
The type of data displayed by the field.
parameterId:
The ID of the parameter displayed by the field.
index:
The index in the list of fields.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The field specified by fieldType and parameterId may not included in this ScheduleDefinition.
-or-
The field specified by fieldType and parameterId is already included in this ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.InsertField(Autodesk.Revit.DB.ScheduleFieldType,System.Int32)
Adds a regular field at the specified position in the list.
fieldType:
The type of data displayed by the field.
index:
The index in the list of fields.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field specified by fieldType may not included in this ScheduleDefinition.
-or-
The field specified by fieldType is already included in this ScheduleDefinition.
-or-
The fieldType can't be CustomField. To add a CustomField, you should create a Schedulable field and add it.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.InsertField(Autodesk.Revit.DB.SchedulableField,System.Int32)
Adds a regular field at the specified position in the list.
schedulableField:
A SchedulableField object representing the field.
index:
The index in the list of fields.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field specified by schedulableField may not included in this ScheduleDefinition.
-or-
The field specified by schedulableField is already included in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is not a valid insert position.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddField(Autodesk.Revit.DB.ScheduleFieldType,Autodesk.Revit.DB.ElementId)
Adds a regular field at the end of the list.
fieldType:
The type of data displayed by the field.
parameterId:
The ID of the parameter displayed by the field.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The field specified by fieldType and parameterId may not included in this ScheduleDefinition.
-or-
The field specified by fieldType and parameterId is already included in this ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddField(Autodesk.Revit.DB.ScheduleFieldType)
Adds a regular field at the end of the list.
fieldType:
The type of data displayed by the field.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field specified by fieldType may not included in this ScheduleDefinition.
-or-
The field specified by fieldType is already included in this ScheduleDefinition.
-or-
The fieldType can't be CustomField. To add a CustomField, you should create a Schedulable field and add it.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddField(Autodesk.Revit.DB.SchedulableField)
Adds a regular field at the end of the list.
schedulableField:
A SchedulableField object representing the field.
Returns:
The new field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The field specified by schedulableField may not included in this ScheduleDefinition.
-or-
The field specified by schedulableField is already included in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsValidCategoryForEmbeddedSchedule(Autodesk.Revit.DB.ElementId)
Indicates if a category can be used for an embedded ScheduleDefinition
in this ScheduleDefinition.
categoryId:
The category ID to check.
Returns:
True if the category can be used for an embedded ScheduleDefinition,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.CanHaveEmbeddedSchedule
Indicates if this ScheduleDefinition can have an embedded ScheduleDefinition
added.
Remarks:
Only schedules of the following categories can have an embedded
ScheduleDefinition:
Rooms
Spaces
Electrical Circuits
Duct Systems
Piping Systems
Mechanical Equipment Sets
MEP Fabrication Ductwork
Fabrication Ductwork Stiffeners
Key schedules cannot have embedded schedules.
Returns:
True if this ScheduleDefinition can have an embedded ScheduleDefinition,
false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddEmbeddedSchedule(Autodesk.Revit.DB.ElementId)
Adds an embedded ScheduleDefinition.
categoryId:
The category ID of elements to display in the embedded schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryId is not the ID of a category that can be used for an embedded
ScheduleDefinition in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition is not a kind of schedule that supports adding an embedded
ScheduleDefinition.
-or-
This ScheduleDefinition already has an embedded ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.IsFilteredBySheet
Indicates if the schedule is set to filter by sheet.
Remarks:
If the schedule is set to filter by sheet, and it is placed on a particular sheet, the
instance created will present only the elements visible in the Viewport(s) on that sheet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The schedule category is not supported to use filter by sheet.
-or-
When setting this property: The Schedule is split already.
Since:
2023

Autodesk.Revit.DB.ScheduleDefinition.GrandTotalTitle
The title name is used to display at the grand total row. The name is "Grand total", expressed in the Revit session language, by default.
Remarks:
GrandTotalTitle can only be set when both ShowGrandTotal and ShowGrandTotalTitle are enabled.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Display of a grand total row is not enabled.
-or-
When setting this property: Display of grand total title is not enabled.
Since:
2015